tutorials/cases/DEM_UsInterp_solidU_test2/0_orig/UsInterp
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UsInterp;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{
    wall
    {
        type zeroGradient;
    }
    inlet
    {
        type zeroGradient;
    }
    outlet
    {
        type zeroGradient;
    }
}
