tutorials/cases/DEM_UsInterp_solidU_test2/Allrun
#!/bin/bash

cp -r 0_orig 0
blockMesh
setFields
decomposePar
mkdir -p spheres

mpirun --allow-run-as-root -n 2 yade MPI_lambda.py
