tutorials/cases/DEM_UsInterp_solidU_test2/constant/yadeProperties

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      yadeProperties;
}

// --------------
// YADE–OpenFOAM coupling properties
// --------------

active          true;

nu                 1e-6;      // kinematic viscosity (m2/s)

partDensity        1000;      // particle density (kg/m3)

fluidDensity       1.0;       // fluid density (kg/m3)
