tutorials/cases/DEM_UsInterp_solidU_test2/system/samples
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;

interpolationScheme cellPoint;

setFormat   raw;

setConfig
{
    type    lineUniform; // lineCell, lineCellFace
    axis    xyz;    // x, y, z, xyz
    nPoints 500;
}

start   (0.02 0. 0.00);
end     (0.02 0. 0.26);

fields  (T Ts Yhum Yrubberwood Ychar1 Ychar Yash O2 H2 CO CO2 H2O CH4 tar porosityF);

sets
(
    line
    {
        $setConfig;
        start $start;
        end   $end;
    }
);

// postProcess -func samples

// p for [i = 6:10] for [j = 0:300:100] './postProcessing/samples/'.j.'/line_T_Ts_Yhum_Ywood_Ychar1_Ychar_Yash_O2_H2_CO_CO2_H2O_CH4_tar.xy' u 3:i w l t 'time '.j.' filed '.i

